Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/permission_to_land_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Permission to enter Ireland
ga: Cead isteach go hÉirinn

source: • EEA and Swiss nationals
ga: • Náisiúnaigh den LEE agus náisiúnaigh na hEilvéise

source: Irish citizens are entitled to enter Ireland
ga: Tá cead isteach go hÉirinn ag saoránaigh Éireannacha

source: If you are a national of the European Economic Area (EEA) or of Switzerland you may be prevented from entering Ireland only in very restricted circumstances – see ‘EEA and Swiss nationals’ below
ga: Más náisiúnach thú den Limistéar Eorpach Eacnamaíoch (LEE) nó den Eilvéis, ní fhéadfaí cead isteach a dhiúltú duit ach i gcúinsí an-teoranta amháin – féach ‘Náisiúnaigh den LEE agus náisiúnaigh na hEilvéise’ thíos

source: Non-EEA nationals need permission to enter Ireland
ga: Tá cead isteach ag teastáil ó náisiúnaigh ó thíortha eile

source: Whether or not you are required to have a visa to enter Ireland, the same rules about permission to enter apply to non-EEA nationals
ga: Baineann na rialacha céanna faoi chead isteach le náisiúnaigh neamh-LEE, cé acu go mbíonn ort, nó nach mbíonn ort víosa a bheith agat chun teach go hÉirinn

source: When you arrive in Ireland, you must report to an immigration officer
ga: Nuair tagann tú isteach in Éirinn, caithfidh tú teacht chuig oifigeach inimirce

source: If you are allowed to enter Ireland, the immigration officer may give you permission to remain in Ireland for up to 3 months – see ‘Non-EEA nationals’ below
ga: Má thugtar cead duit teacht isteach in Éirinn, d’fhéadfadh an t-oifigeach inimirce cead fanacht in Éirinn ar feadh uasmhéid 3 mhí - féach 'Náisiúnaigh neamh-LEE' thíos

source: Travel with a child aged under 18: The Irish Naturalisation and Immigration Service (INIS) has published advice for people travelling to Ireland with a minor who is not their child or who has a different surname
ga: Ag taisteal le leanbh faoi bhun aois 18: D’fhoilsigh an tSeirbhís Eadóirseachta agus Inimirce na hÉireann comhairle do dhaoine atá ag taisteal in Éirinn in éineacht le mionaoiseach nach a chuid leanbh é nó le sloinne difriúil air

source: Advance Passenger Information: The European Communities (Communication of Passenger Data) Regulations 2011 requesting airlines to provide Advance Passenger Information (API) apply to all inbound flights to Ireland from outside the EU
ga: Réamheolas Paisinéara: Faoin Rialacháin na gComhphobal Eorpach (Cumarsáid Sonraí Paisinéara) 2011, iarrtar ar aerlínte Réamheolas Paisinéara (RP) a sholáthar

source: It is aimed at improving border control and combating illegal immigration
ga: Baineann an beart seo le gach eitilt isteach go hÉirinn ó lasmuigh den AE agus tá sé dírithe ar rialú teorann a fheabhsú agus inimirce mhídhleathach a chomhrac

source: EEA and Swiss nationals
ga: Náisiúnaigh den LEE agus náisiúnaigh na hEilvéise

source: If you are an EEA or Swiss national, you may be refused permission to enter Ireland only if:
ga: Más náisiúnach thú den LEE nó den Eilvéis, ní fhéadfaí cead isteach go hÉirinn a dhiúltú duit ach amháin:

source: • You are suffering from a specified disease or disability or
ga: • Má bhíonn galar sonrach ag cur ort nó míchumas nó

source: • Your conduct has been such that it would be contrary to public policy or would endanger public security
ga: • Má iompraíonn tú tú féin i slí nach mbeadh ar aon dul le polasaí poiblí nó a chuirfeadh sábháilteacht phoiblí i mbaol

source: You do not have to register with the immigration authorities as EEA and Swiss nationals have specific rights to live and work in Ireland
ga: Ní mór duit clárú leis na húdaráis inimirce mar tá cearta sonracha ag náisiúnaigh den LEE agus den Eilvéis cónaí in Éirinn agus fostaíocht a fháil sa tír seo

source: If you are a national of any other country, you must get permission to enter when you arrive in Ireland
ga: Más náisiúnach thú ó aon tír eile, caithfidh tú cead isteach a fháil nuair a thagann tú go hÉirinn

source: If you are refused permission to enter
ga: Mura bhfaigheann tú cead isteach go hÉirinn

source: The immigration officer may refuse for any one of a number of reasons
ga: Is féidir leis an oifigeach inimirce cead a dhiúltú duit ar cheann ar bith de mhéid áirithe cúiseanna

source: For example, permission may be refused if the immigration officer has reason to believe that:
ga: Mar shampla, féadfar cead isteach a dhiúltú duit má cheapann an t-oifigeach inimirce:

source: • You are not in a position to support yourself and any dependants arriving with you
ga: • Nach féidir leat déanamh duit féin agus d'aon cleithiúnaithe a thagann isteach leat

source: • You intend to take up employment and you do not have a permit
ga: • Go bhfuil sé ar intinn agat fostaíocht a fháil agus nach bhfuil ceadúnas agat

source: • You suffer from certain specified conditions - these include TB, other infectious diseases, drug addiction and profound mental disturbance (this is defined as “manifest conditions of psychotic disturbance with agitation, delirium, hallucinations or confusion”)
ga: • Go bhfuil riochtaí sonracha áirithe ag cur ort, ag cur san áireamh Eitinn, galair tógálacha eile, andúil i ndruga agus mórshuaitheadh intinne (sainmhínítear é seo mar “riochtaí soiléire le suaitheadh síocóiseach le buaireamh, le rámhaille, le siabhránachta nó le mearbhall”)

source: • You have been convicted of an offence which carries a penalty of a year’s imprisonment or more
ga: • Gur chiontaíodh thú i gcionta agus gur cuireadh pionós ort bliain amháin nó níos mó a chaitheamh sa phríosún

source: • You are obliged to have a visa and you do not have one
ga: • Go bhfuil dualgas ort víosa a bheith agat agus nach bhfuil ceann agat

source: • You are the subject of a deportation order, an exclusion order or similar order
ga: • Go bhfuil ordú díbeartha faighte agat, ordú ionnarbtha nó ordú eile cosúil leo

source: • You do not have a valid passport
ga: • Nach bhfuil pas bailí agat

source: • You intend to travel to Great Britain or Northern Ireland and you do not have a right to enter there
ga: • Go bhfuil sé ar intinn agat taisteal go Sasana nó go dtí Tuaisceart na hÉireann agus nach bhfuil cead isteach agat ann

source: • Your entry or presence in Ireland could pose a threat to national security or be contrary to public policy
ga: • Go gcuirfí sábháilteacht náisiúnta i mbaol nó nach mbeadh sé ar aon dul le polasaí poiblí é dá dtiocfá go hÉirinn agus dá bhfanfá anseo

source: If you are refused permission to enter you must be given the reasons in writing
ga: Mura dtugtar cead isteach duit caithfear cuntas scríofa a thabhairt duit ar na cúiseanna

source: If you are granted permission to enter
ga: Má fhaigheann tú cead isteach go hÉirinn

source: You may be given permission to enter but with conditions attached
ga: B'fhéidir go dtabharfar cead isteach duit ach beidh coinníollacha ag gabháil leis

source: For example, you may be allowed stay for a stated period only
ga: Mar shampla, ní thabharfar cead duit fanacht ach ar feadh tréimhse áirithe ama

source: The immigration officer may grant you a visitor permission which allows you to stay for a maximum of 3 months
ga: D’fhéadfadh go dtugann an oifig inimirce duit cead cuairteora a cheadaíonn thú fanacht ar feadh uasmhéid 3 mhí

source: In certain unforeseen circumstances, this visitor permission may be extended
ga: In imthosca gan coinne áirithe, is féidir an cead cuairteora seo bheith sínithe

source: If you wish to stay in Ireland for longer than this you must apply for permission to remain by registering with your local immigration office
ga: Má theastaíonn uait fanacht in Éirinn ar feadh tréimhse níos faide, beidh ort cead fanachta a fháil trí chlárú a dhéanamh ag d'oifig inimirce áitiúil

source: In Dublin this is the Burgh Quay Registration Office and outside Dublin it is your regional registration office or local garda district headquarters – see ‘Where to apply’ below
ga: Déanfar é seo ag Oifig Chlárúcháin Cé an Bhúrcaigh i mBaile Átha Cliath, agus ag oifig chlárúcháin régiúnach nó ceanncheathrú réigiúnach an Gharda Síochána, má tá cónaí ort lasmuigh de Bhaile Átha Cliath - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: You can read more in our document, Registration of non-EEA nationals in Ireland
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad, Clárú náisiúnach neamh-LEE in Éirinn

source: However, visa-required nationals who have entered Ireland on a C visa cannot extend their permission to remain
ga: Áfach, má thagann náisiúnaigh nach mór víosa a bheith acu isteach go hÉirinn le víosa C, ní féidir leo a gcead fanacht a shíniú

source: They must leave and apply for a D visa from outside Ireland if they wish to return
ga: Ní mór dóibh fágáil agus iarratas ar víosa D a dhéanamh lasmuigh den Stát más mian leo filleadh
